src/colophon.org
#+TITLE: Current Build Process For This Site
#+AUTHOR: Alex Drysdale
#+DATE: <2025-04-19 Sat>
#+PROPERTY: header-args:elisp :tangle "build.el"
#+FILETAGS: :emacs:

This website is built with =org-mode= and hosted through GitHub pages.

GitHub pages expects only a single =index.html= file and builds the site the from the =docs= directory - making the build process extremely simple.

Naturally, as this site is purely static there's no user tracking or even a requirement for =https=!

* Build output

The build output will reside in =docs= to start we'll delete that directory and copy over the css files (that reside in =resources/= and tell GitHub that this isn't a Jekyll site.

#+begin_src elisp :results none
  ;; Delete the docs directory
  (when (file-exists-p "docs")
    (delete-directory "docs" t))

  ;; Delete tag files
  (dolist (file (directory-files "src" nil "^tags-.*\\.org$"))
    (when (file-regular-p (expand-file-name file "src"))
      (delete-file (expand-file-name file "src"))))

  ;; Copy resources to the docs directory
  (make-directory "docs" t)
  (copy-directory "src/resources" "docs/resources" t t)

  ;; Tell github this isn't a Jekyll cite and insert the CNAME
  (with-temp-file (expand-file-name "docs/.nojekyll"))
  (with-temp-file (expand-file-name "docs/CNAME")
    (insert "abdrysdale.phd"))
#+end_src


* Installing required packages

We'll need to use an elisp package (=htmlize=) for the build process. The build process will work fine on my machine but I'll need this bit for continuous integration.

#+begin_src elisp :results none
  ;; Initialize package system
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (unless package--initialized (package-initialize))

  (unless (package-installed-p 'htmlize)
    (package-refresh-contents)
    (package-install 'htmlize))
#+end_src

