docs/colophon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Current Build Process For This Site</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Current Build Process For This Site</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org25a9062">Build output</a></li>
<li><a href="#org2b13eac">Installing required packages</a></li>
<li><a href="#org962bcbf">Building the Home Page</a></li>
<li><a href="#orgcb2e999">Add an RSS feed</a></li>
<li><a href="#orgf762855">Publishing the Site</a></li>
<li><a href="#org75691eb">Git Hooks</a></li>
<li><a href="#orge741622">Conclusion</a></li>
</ul>
</div>
</div>
<p>
This website is built with <code>org-mode</code> and hosted through GitHub pages.
</p>

<p>
GitHub pages expects only a single <code>index.html</code> file and builds the site the from the <code>docs</code> directory - making the build process extremely simple.
</p>

<p>
Naturally, as this site is purely static there's no user tracking or even a requirement for <code>https</code>!
</p>
<div id="outline-container-org25a9062" class="outline-2">
<h2 id="org25a9062">Build output</h2>
<div class="outline-text-2" id="text-org25a9062">
<p>
The build output will reside in <code>docs</code> to start we'll delete that directory and copy over the css files (that reside in <code>resources/</code> and tell GitHub that this isn't a Jekyll site.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Delete the docs directory</span>
(<span style="font-weight: bold;">when</span> (file-exists-p <span style="font-style: italic;">"docs"</span>)
  (delete-directory <span style="font-style: italic;">"docs"</span> t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Delete tag files</span>
(<span style="font-weight: bold;">dolist</span> (file (directory-files <span style="font-style: italic;">"src"</span> nil <span style="font-style: italic;">"^tags-.*\\.org$"</span>))
  (<span style="font-weight: bold;">when</span> (file-regular-p (expand-file-name file <span style="font-style: italic;">"src"</span>))
    (delete-file (expand-file-name file <span style="font-style: italic;">"src"</span>))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Copy resources to the docs directory</span>
(make-directory <span style="font-style: italic;">"docs"</span> t)
(copy-directory <span style="font-style: italic;">"src/resources"</span> <span style="font-style: italic;">"docs/resources"</span> t t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Tell github this isn't a Jekyll cite and insert the CNAME</span>
(<span style="font-weight: bold;">with-temp-file</span> (expand-file-name <span style="font-style: italic;">"docs/.nojekyll"</span>))
(<span style="font-weight: bold;">with-temp-file</span> (expand-file-name <span style="font-style: italic;">"docs/CNAME"</span>)
  (insert <span style="font-style: italic;">"abdrysdale.phd"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2b13eac" class="outline-2">
<h2 id="org2b13eac">Installing required packages</h2>
<div class="outline-text-2" id="text-org2b13eac">
<p>
We'll need to use an elisp package (<code>htmlize</code>) for the build process. The build process will work fine on my machine but I'll need this bit for continuous integration.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize package system</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(add-to-list 'package-archives '(<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>) t)
(<span style="font-weight: bold;">unless</span> package--initialized (package-initialize))

(<span style="font-weight: bold;">unless</span> (package-installed-p 'htmlize)
  (package-refresh-contents)
  (package-install 'htmlize))
</pre>
</div>
</div>
</div>
