src/colophon.org
* Building the Home Page

The first thing I want on the home page is a list of articles with the article title as the description.
I'd also like a list of tags that are used on the articles so the user can search by topic - topics are stored in the =FILETAGS= property.
To do this, I create a cons list of =(title . path)= of each article in the =src/= directory that isn't =index.org=.

First things first, let's define a generic function for extracting properties from an org-mode document.
#+begin_src elisp :results none
  (defun get-org-property (prop file)
    "Extract PROP from the org FILE."
    (when (file-exists-p file)
      (with-temp-buffer
        (insert-file-contents file)
        ;; No need for error handling here as (cdr nil) and (car nil) return nil
        (car (cdr (car (org-collect-keywords `(,prop))))))))
#+end_src

Next we define a function that returns all of the articles in format =(file . link-title)=.

#+begin_src elisp :results none
  (defun get-titles-from-org-files (directory)
    "Extract titles and dates from org files in DIRECTORY."
    (let ((files (directory-files directory t "^[[:alnum:]-_]+.org$")))
      (mapcar (lambda (file)
                (let ((rel-file (file-relative-name
                                 file (expand-file-name directory))))
                  `(,rel-file . ,(list
                                  (get-org-property "TITLE" file)
                                  (get-org-property "DATE" file)
                                  (get-org-property "FILETAGS" file)))))
              files)))
#+end_src

Next the home page (=index.org=) is built. Currently this is really simple and just includes a template followed by a list of all of the articles and then a list of all the tags.

We'll take this template:
#+begin_src org :tangle index-template.org :eval no
  I'm Alex, a PhD candidate (haemodynamics + graph convolutional neural networks) and a trainee magnetic resonance physicist for NHS Wales.
  Thank you for visiting my little patch of the internet.
  All views are my own and not that of my employer.

  You can expect content on programming, Emacs, philosophy, ethics, magnets and bread.
  In addition to this, I'll try to post explanations of papers that I publish. If I'm not the first author I'll do my best to explain the paper or, more likely, explain my contribution to paper.

  /This is site is intentially minimal and left as an exercise to the reader.../

  ,* Copying

  All material is in the website licensed under the the GNU/GPLv3 license - 
  which can be found [[https://github.com/abdrysdale/abdrysdale.github.io/blob/main/LICENSE][here]].
#+end_src

insert a title and then add the articles and tags.

#+RESULTS:

#+begin_src elisp :results none
  (defun build-index (author)
    "Build the index for the AUTHOR."
    ;; Copies the README.org to the index.
    (let ((dir "src")
          (index "src/index.org")
          (ignore-files '("index.org"
                          "about.org"
                          "sitemap.org"
                          "index-template.org"))
          (used-tags nil)
          (articles nil))

      ;; Inserts title and template
      (with-current-buffer (find-file-noselect index)
        (erase-buffer)
        (insert (format "#+title: %s\n\n" author))
        (insert-file-contents "../index-template.org")
        (end-of-buffer)
        (insert "\n\n* Articles\n")
        (save-buffer))

      ;; Gets all of the articles
      (dolist (result (get-titles-from-org-files dir))
        (let ((path (car result))
              (info (cdr result)))
          (unless (member path ignore-files)
            (push `(,path ,(car info) ,(cadr info) ,(caddr info)) articles))))

      ;; Sort articles by date
      (setq articles (sort articles (lambda (a b)
                                (let ((date-a (caddr a))
                                      (date-b (caddr b)))
                                  (string> (substring date-a 1 -1)
                                           (substring date-b 1 -1))))))

      ;; Insert links to articles in the index and tag files
      (dolist (article articles)
        (let ((path (car article))
              (title (cadr article))
              (date (caddr article))
              (tags (cadddr article)))
          (with-current-buffer (find-file-noselect index)
            (goto-char (point-max))
            (let ((link (format
                         "- [[file:%s][%s]] %s\t%s\n"
                         path
                         title
                         date
                         (replace-regexp-in-string ":" "/" tags))))
              (insert link)
              (save-buffer)

              ;; Insert a link to article in each of the tags file.
              (dolist (tag (split-string tags ":"))
                (unless (string-empty-p tag)
                  (let* ((tag-file (concat "tags-" tag ".org"))
                         (tag-entry `(,tag . ,tag-file)))
                    (unless (member tag-entry used-tags)
                      (push tag-entry used-tags))
                    (with-current-buffer (find-file-noselect tag-file)
                      (unless (file-exists-p tag-file)
                        (erase-buffer)
                        (insert (format "#+title:%s\n\n" tag)))
                      (goto-char (point-max))
                      (insert link)
                      (save-buffer)))))))))

            ;; Insert a link to the tag files in the index
            (with-current-buffer (find-file-noselect index)
              (insert "\n* Tags\n\n")
              (dolist (tag-info used-tags)
                (let ((tag (car tag-info))
                      (file (cdr tag-info)))
                  (insert (format "- [[file:%s][%s]]\n" file tag))))
              (save-buffer))))
#+end_src

