docs/colophon.html
<div id="outline-container-org962bcbf" class="outline-2">
<h2 id="org962bcbf">Building the Home Page</h2>
<div class="outline-text-2" id="text-org962bcbf">
<p>
The first thing I want on the home page is a list of articles with the article title as the description.
I'd also like a list of tags that are used on the articles so the user can search by topic - topics are stored in the <code>FILETAGS</code> property.
To do this, I create a cons list of <code>(title . path)</code> of each article in the <code>src/</code> directory that isn't <code>index.org</code>.
</p>

<p>
First things first, let's define a generic function for extracting properties from an org-mode document.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-org-property</span> (prop file)
  <span style="font-style: italic;">"Extract PROP from the org FILE."</span>
  (<span style="font-weight: bold;">when</span> (file-exists-p file)
    (<span style="font-weight: bold;">with-temp-buffer</span>
      (insert-file-contents file)
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">No need for error handling here as (cdr nil) and (car nil) return nil</span>
      (car (cdr (car (org-collect-keywords `(,prop))))))))
</pre>
</div>

<p>
Next we define a function that returns all of the articles in format <code>(file . link-title)</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-titles-from-org-files</span> (directory)
 <span style="font-style: italic;">"Extract titles from org files in DIRECTORY."</span>
 (<span style="font-weight: bold;">let</span> ((files (directory-files directory t <span style="font-style: italic;">"^[[:alnum:]-_]+.org$"</span>)))
   (mapcar (<span style="font-weight: bold;">lambda</span> (file)
             (<span style="font-weight: bold;">let</span> ((rel-file (file-relative-name
                              file (expand-file-name directory))))
               `(,rel-file . ,(concat
                               (get-org-property <span style="font-style: italic;">"TITLE"</span> file)
                               <span style="font-style: italic;">"\t"</span>
                               (get-org-property <span style="font-style: italic;">"FILETAGS"</span> file)))))
           files)))
</pre>
</div>

<p>
Next the home page (<code>index.org</code>) is built. Currently this is really simple and just includes a template followed by a list of all of the articles and then a list of all the tags.
</p>

<p>
We'll take this template:
</p>
<div class="org-src-container">
<pre class="src src-org">I'm Alex, a PhD candidate (haemodynamics + graph convolutional neural networks) and a trainee magnetic resonance physicist for NHS Wales.
Thank you for visiting my little patch of the internet.
All views are my own and not that of my employer.

You can expect content on programming, Emacs, philosophy, ethics, magnets and bread.
In addition to this, I'll try to post explanations of papers that I publish. If I'm not the first author I'll do my best to explain the paper or, more likely, explain my contribution to paper.

<span style="font-style: italic;">/This is site is intentially minimal and left as an exercise to the reader.../</span>

<span style="font-weight: bold;">* Copying</span>

All material is in the website licensed under the the GNU/GPLv3 license - 
which can be found <span style="text-decoration: underline;"><a href="https://github.com/abdrysdale/abdrysdale.github.io/blob/main/LICENSE">here</a></span>.
</pre>
</div>

<p>
insert a title and then add the articles and tags.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">build-index</span> (author)
  <span style="font-style: italic;">"Build the index for the AUTHOR."</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Copies the README.org to the index.</span>
  (<span style="font-weight: bold;">let</span> ((dir <span style="font-style: italic;">"src"</span>)
        (index <span style="font-style: italic;">"src/index.org"</span>)
        (ignore-files '(<span style="font-style: italic;">"index.org"</span>
                        <span style="font-style: italic;">"about.org"</span>
                        <span style="font-style: italic;">"sitemap.org"</span>
                        <span style="font-style: italic;">"index-template.org"</span>))
        (used-tags nil))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Inserts title and template</span>
    (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect index)
      (erase-buffer)
      (insert (format <span style="font-style: italic;">"#+title: %s\n\n"</span> author))
      (insert-file-contents <span style="font-style: italic;">"../index-template.org"</span>)
      (end-of-buffer)
      (insert <span style="font-style: italic;">"\n\n* Articles\n"</span>)
      (save-buffer))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Gets all of the articles</span>
    (<span style="font-weight: bold;">dolist</span> (result (get-titles-from-org-files dir))
      (<span style="font-weight: bold;">let</span> ((path (car result))
            (title (cdr result)))
        (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect index)
          (goto-char (point-max))
          (<span style="font-weight: bold;">unless</span> (member path ignore-files)
            (<span style="font-weight: bold;">let</span> ((link (format <span style="font-style: italic;">"- [[file:%s][%s]]\n"</span> path title))
                  (tags (get-org-property <span style="font-style: italic;">"FILETAGS"</span> path)))
              (insert link) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Insert a link to article in the index</span>

              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Insert a link to article in each of the tags file.</span>
              (<span style="font-weight: bold;">dolist</span> (tag (split-string tags <span style="font-style: italic;">":"</span>))
                (<span style="font-weight: bold;">unless</span> (string-empty-p tag)
                  (<span style="font-weight: bold;">let*</span> ((tag-file (concat <span style="font-style: italic;">"tags-"</span> tag <span style="font-style: italic;">".org"</span>))
                         (tag-entry `(,tag . ,tag-file)))
                    (<span style="font-weight: bold;">unless</span> (member tag-entry used-tags)
                      (<span style="font-weight: bold;">push</span> tag-entry used-tags))
                    (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect tag-file)
                      (<span style="font-weight: bold;">unless</span> (file-exists-p tag-file)
                        (erase-buffer)
                        (insert (format <span style="font-style: italic;">"#+title:%s\n\n"</span> tag)))
                      (insert link)
                      (save-buffer)))))
              (save-buffer))))))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Insert a link to the tag files in the index</span>
    (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect index)
      (insert <span style="font-style: italic;">"\n* Tags\n\n"</span>)
      (<span style="font-weight: bold;">dolist</span> (tag-info used-tags)
        (<span style="font-weight: bold;">let</span> ((tag (car tag-info))
              (file (cdr tag-info)))
          (insert (format <span style="font-style: italic;">"- [[file:%s][%s]]\n"</span> file tag)))))))
</pre>
</div>
</div>
</div>
