src/colophon.org
* Add an RSS feed

#+begin_src elisp
(defun get-string-from-file (filePath)
  "Return file content as string."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
;; 2010-09-02 thanks to Pascal J Bourguignon and TheFlyingDutchman
#+end_src

#+begin_src elisp
  (defun get-rss-feed-item (title link date &optional desc)
    "Return an rss feed item with TITLE, LINK, DATE and DESCRIPTION."
    (concat
     "<item>\n"
     "<title>" title "</title>\n"
     "<link>" link "</link>\n"
     "<pubDate>" date "</pubDate>\n"
     "<description><![CDATA[" (if desc desc "") "]]></description>\n"
     "</item>\n"))
#+end_src

#+RESULTS:
: get-rss-feed-item

#+begin_src elisp
    (defun build-rss-feed (title link desc src out)
      "Build a rss feed for TITLE (DESC) at LINK using the posts in SRC to OUT."
      (with-current-buffer (find-file-noselect (concat out "feed.xml"))
        (erase-buffer)
        (insert (concat
                 "<rss version=\"2.0\">\n"
                 "<channel>\n"
                 "<title>" title "</title>\n"
                 "<description>" desc "</description>\n"
                 "<link>" link "</link>\n"))
        (dolist (file (directory-files src nil "^[[:alnum:]-_]+.org$"))
          (let ((date (get-org-property "DATE" (concat src "/" file))))
            (insert (get-rss-feed-item (get-org-property "TITLE"
                                                         (concat src "/" file))
                                       (concat link "/"
                                               (car (split-string file ".org"))
                                               ".html")
                                       date
                                       (get-string-from-file
                                        (concat src "/" file))))))
        (insert "</channel>\n</rss>")
        (save-buffer)))
#+end_src

#+RESULTS:
: build-rss-feed

* Publishing the Site

Finally, the site is published using =ox-publish= with this article (the =README.org=) being copied as an article.

One thing of note is that we always publish the articles under the same theme for continuity.

#+begin_src elisp
  (require 'ox-publish)
  (require 'whitespace)
  (require 'htmlize)
  (let ((current-theme (if custom-enabled-themes
                           (car custom-enabled-themes)
                         'modus-operandi))
        (publish-theme 'modus-operandi)
        (whitespace-style nil)
        (whitespace-mode 0)
        (org-html-validation-link nil)
        (org-html-head-include-scripts nil)
        (org-html-head-include-default-style nil)
        (org-html-head (concat
                        "<link rel=\"stylesheet\""
                        "href=\"resources/org.css\""
                        "type=\"text/css\" />"
                        "<header>"
                        "<a href=\"index.html\">Home</a>"
                        "&emsp;<a href=\"about.html\">About Me</a>"
                        "&emsp;<a href=\"https://github.com/abdrysdale/abdrysdale.github.io\">Source</a>"
                        "&emsp;<a href=\"sitemap.html\">Sitemap</a>"
                        "&emsp;<a href=\"feed.xml\">RSS</a>"
                        "</header>\n"))
        (org-src-fontify-natively t)
        (org-publish-project-alist
         '(("blog"
            :base-directory "src"
            :recursive nil
            :publishing-directory "docs"
            :auto-sitemap t
            :with-author nil
            :with-creator t
            :with-toc t
            :headline-levels 1
            :section-numbers nil
            :time-stamp-file nil
            :publishing-function org-html-publish-to-html))))
    (copy-file "README.org" "src/colophon.org" t)
    (build-index "Alex Drysdale")
    (build-rss-feed
     "Alex Drysdale"
     "https://abdrysdale.phd"
     "Blog posts by Alex Drysdale"
     "../src/" "docs/")
    (load-theme publish-theme)
    (org-publish-all t)
    (load-theme current-theme)
    (message "Site built at %s"
             (format-time-string "%Y-%m-%d %H:%M:%S")))
#+end_src

#+RESULTS:
: Site built at 2025-06-17 19:28:31


* Git Hooks

This script is tangled into =.git/hooks/build.el= which means that we just need to create a =pre-commit= hook that runs the =build.el= file.

#+begin_src bash :results none :tangle ".git/hooks/pre-commit" :eval no
  #!/bin/sh
  emacs --batch -Q --script build.el
  git add docs/*.html
#+end_src

and make that file executable:
#+begin_src bash :tangle no :results none
  chmod +x .git/hooks/pre-commit
#+end_src


* Conclusion

Not the most beautiful blog, or the most elegant build solution but this allows me to just write without thinking about much each.

There's still a few things I'd like to implement in the build process namely:

** DONE Include the date in the article link title and sort by date - /newest first/.
- State "DONE"       from "TODO"       [2025-06-17 Tue 19:28]
At this stage of the site, with the number of posts in the single digits, it's not essential.
** TODO Have each blog have a link to the tags file of the associated =FILETAGS= in that blog.
Similar to above, this will need to be sorted when more posts come into existence.
** TODO Include the following [[https://slashpages.net/][slashpages]] in the index
*** TODO [[https://blogroll.org/][blogroll]]
A list of blogs that I follow.
*** TODO [[https://bukmark.club/directory/][links]]
Similar to blogroll but for specific posts.
*** TODO [[https://indieweb.org/release_notes][changelog]]
*** TODO [[https://indieweb.org/contact][contact]]
*** TODO [[https://thechels.uk/green][green]]
Include some tangible targets and current status/metrics.
*** TODO [[https://chrisburnell.com/note/slash-interests/][interests]]
Nice way to express the things I'm interested in.
