docs/colophon.html
<div id="outline-container-orgcb2e999" class="outline-2">
<h2 id="orgcb2e999">Add an RSS feed</h2>
<div class="outline-text-2" id="text-orgcb2e999">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-rss-feed-item</span> (title link)
  <span style="font-style: italic;">"Return an rss feed item with TITLE and LINK."</span>
  (concat
   <span style="font-style: italic;">"&lt;item&gt;\n"</span>
   <span style="font-style: italic;">"&lt;title&gt;"</span> title <span style="font-style: italic;">"&lt;/title&gt;\n"</span>
   <span style="font-style: italic;">"&lt;link&gt;"</span> link <span style="font-style: italic;">"&lt;/link&gt;\n"</span>
   <span style="font-style: italic;">"&lt;/item&gt;\n"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">build-rss-feed</span> (title link desc src out)
  <span style="font-style: italic;">"Build a rss feed for TITLE (DESC) at LINK using the posts in SRC to OUT."</span>
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect (concat out <span style="font-style: italic;">"feed.xml"</span>))
    (erase-buffer)
    (insert (concat
             <span style="font-style: italic;">"&lt;rss version=\"2.0\"&gt;\n"</span>
             <span style="font-style: italic;">"&lt;channel&gt;\n"</span>
             <span style="font-style: italic;">"&lt;title&gt;"</span> title <span style="font-style: italic;">"&lt;/title&gt;\n"</span>
             <span style="font-style: italic;">"&lt;description&gt;"</span> desc <span style="font-style: italic;">"&lt;/description&gt;\n"</span>
             <span style="font-style: italic;">"&lt;link&gt;"</span> link <span style="font-style: italic;">"&lt;/link&gt;\n"</span>))
    (<span style="font-weight: bold;">dolist</span> (file (directory-files src nil <span style="font-style: italic;">"^[[:alnum:]-_]+.org$"</span>))
      (insert (get-rss-feed-item (get-org-property <span style="font-style: italic;">"TITLE"</span>
                                                   (concat src <span style="font-style: italic;">"/"</span> file))
                                 (concat link <span style="font-style: italic;">"/"</span>
                                         (car (split-string file <span style="font-style: italic;">".org"</span>))
                                         <span style="font-style: italic;">".html"</span>))))
    (insert <span style="font-style: italic;">"&lt;/channel&gt;\n&lt;/rss&gt;"</span>)
    (save-buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf762855" class="outline-2">
<h2 id="orgf762855">Publishing the Site</h2>
<div class="outline-text-2" id="text-orgf762855">
<p>
Finally, the site is published using <code>ox-publish</code> with this article (the <code>README.org</code>) being copied as an article.
</p>

<p>
One thing of note is that we always publish the articles under the same theme for continuity.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">whitespace</span>)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">htmlize</span>)
(<span style="font-weight: bold;">let</span> ((current-theme (<span style="font-weight: bold;">if</span> custom-enabled-themes
                         (car custom-enabled-themes)
                       'modus-operandi))
      (publish-theme 'modus-operandi)
      (whitespace-style nil)
      (whitespace-mode 0)
      (org-html-validation-link nil)
      (org-html-head-include-scripts nil)
      (org-html-head-include-default-style nil)
      (org-html-head (concat
                      <span style="font-style: italic;">"&lt;link rel=\"stylesheet\""</span>
                      <span style="font-style: italic;">"href=\"resources/org.css\""</span>
                      <span style="font-style: italic;">"type=\"text/css\" /&gt;"</span>
                      <span style="font-style: italic;">"&lt;header&gt;"</span>
                      <span style="font-style: italic;">"&lt;a href=\"index.html\"&gt;Home&lt;/a&gt;"</span>
                      <span style="font-style: italic;">"&amp;emsp;&lt;a href=\"about.html\"&gt;About Me&lt;/a&gt;"</span>
                      <span style="font-style: italic;">"&amp;emsp;&lt;a href=\"https://github.com/abdrysdale/abdrysdale.github.io\"&gt;Source&lt;/a&gt;"</span>
                      <span style="font-style: italic;">"&amp;emsp;&lt;a href=\"sitemap.html\"&gt;Sitemap&lt;/a&gt;"</span>
                      <span style="font-style: italic;">"&amp;emsp;&lt;a href=\"feed.xml\"&gt;RSS&lt;/a&gt;"</span>
                      <span style="font-style: italic;">"&lt;/header&gt;\n"</span>))
      (org-src-fontify-natively t)
      (org-publish-project-alist
       '((<span style="font-style: italic;">"blog"</span>
          <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"src"</span>
          <span style="font-weight: bold;">:recursive</span> t
          <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"docs"</span>
          <span style="font-weight: bold;">:auto-sitemap</span> t
          <span style="font-weight: bold;">:recursive</span> t
          <span style="font-weight: bold;">:with-author</span> nil
          <span style="font-weight: bold;">:with-creator</span> t
          <span style="font-weight: bold;">:with-toc</span> t
          <span style="font-weight: bold;">:headline-levels</span> 1
          <span style="font-weight: bold;">:section-numbers</span> nil
          <span style="font-weight: bold;">:time-stamp-file</span> nil
          <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html))))
  (copy-file <span style="font-style: italic;">"README.org"</span> <span style="font-style: italic;">"src/colophon.org"</span> t)
  (build-index <span style="font-style: italic;">"Alex Drysdale"</span>)
  (build-rss-feed
   <span style="font-style: italic;">"Alex Drysdale"</span>
   <span style="font-style: italic;">"https://abdrysdale.phd"</span>
   <span style="font-style: italic;">"Blog posts by Alex Drysdale"</span>
   <span style="font-style: italic;">"../src/"</span> <span style="font-style: italic;">"docs/"</span>)
  (load-theme publish-theme)
  (org-publish-all t)
  (load-theme current-theme)
  (message <span style="font-style: italic;">"Site built at %s"</span>
           (format-time-string <span style="font-style: italic;">"%Y-%m-%d %H:%M:%S"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org75691eb" class="outline-2">
<h2 id="org75691eb">Git Hooks</h2>
<div class="outline-text-2" id="text-org75691eb">
<p>
This script is tangled into <code>.git/hooks/build.el</code> which means that we just need to create a <code>pre-commit</code> hook that runs the <code>build.el</code> file.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">sh</span>
emacs --batch -Q --script build.el
git add docs/*.html
</pre>
</div>

<p>
and make that file executable:
</p>
<div class="org-src-container">
<pre class="src src-bash">chmod +x .git/hooks/pre-commit
</pre>
</div>
</div>
</div>
<div id="outline-container-orge741622" class="outline-2">
<h2 id="orge741622">Conclusion</h2>
<div class="outline-text-2" id="text-orge741622">
<p>
Not the most beautiful blog, or the most elegant build solution but this allows me to just write without think about much each.
</p>

<p>
There's still a few things I'd like to implement in the build process namely:
</p>
</div>
<ul class="org-ul">
<li><a id="org889c666"></a><span class="todo TODO">TODO</span> Include the date in the article link title and sort by date - <i>newest first</i>.<br />
<div class="outline-text-3" id="text-org889c666">
<p>
At this stage of the site, with the number of posts in the single digits, it's not essential.
</p>
</div>
</li>
<li><a id="org9bdc97b"></a><span class="todo TODO">TODO</span> Have each blog have a link to the tags file of the associated <code>FILETAGS</code> in that blog.<br />
<div class="outline-text-3" id="text-org9bdc97b">
<p>
Similar to above, this will need to be sorted when more posts come into existence.
</p>
</div>
</li>
<li><a id="org3a6eb8d"></a><span class="todo TODO">TODO</span> Include the following <a href="https://slashpages.net/">slashpages</a> in the index<br />
<ul class="org-ul">
<li><a id="org4e4426e"></a><span class="todo TODO">TODO</span> <a href="https://blogroll.org/">blogroll</a><br />
<div class="outline-text-4" id="text-org4e4426e">
<p>
A list of blogs that I follow.
</p>
</div>
</li>
<li><a id="orga88151e"></a><span class="todo TODO">TODO</span> <a href="https://bukmark.club/directory/">links</a><br />
<div class="outline-text-4" id="text-orga88151e">
<p>
Similar to blogroll but for specific posts.
</p>
</div>
</li>
<li><a id="org69bd3a2"></a><span class="todo TODO">TODO</span> <a href="https://indieweb.org/release_notes">changelog</a><br /></li>
<li><a id="orgc3edc34"></a><span class="todo TODO">TODO</span> <a href="https://indieweb.org/contact">contact</a><br /></li>
<li><a id="org011e3e0"></a><span class="todo TODO">TODO</span> <a href="https://thechels.uk/green">green</a><br />
<div class="outline-text-4" id="text-org011e3e0">
<p>
Include some tangible targets and current status/metrics.
</p>
</div>
</li>
<li><a id="orga5bf56b"></a><span class="todo TODO">TODO</span> <a href="https://chrisburnell.com/note/slash-interests/">interests</a><br />
<div class="outline-text-4" id="text-orga5bf56b">
<p>
Nice way to express the things I'm interested in.
</p>
</div>
</li>
