src/colophon.org
*** TODO [[https://www.miriamsuzanne.com/why][why]]
*** DONE [[https://aboutideasnow.com/][ideas]]
- State "DONE"       from "TODO"       [2025-06-17 Tue 22:11]
A list of the half-baked ideas I have.
*** TODO [[https://rknight.me/next][next]] or [[https://fyr.io/yep][yep]]
The better ideas should hopefully go here after I've given some thought and deemed them worth my time.
*** TODO [[https://baty.net/nope][nope]]
The not so good ideas will go here to remind myself not to keep thinking about them.
** TODO Include a link a page on projects that I've developed
