docs/colophon.html
<li><a id="orgea9ae04"></a><span class="todo TODO">TODO</span> <a href="https://www.miriamsuzanne.com/why">why</a><br /></li>
<li><a id="org15da5f5"></a><span class="todo TODO">TODO</span> <a href="https://aboutideasnow.com/">ideas</a><br />
<div class="outline-text-4" id="text-org15da5f5">
<p>
A list of the half-baked ideas I have.
</p>
</div>
</li>
<li><a id="org1899f4e"></a><span class="todo TODO">TODO</span> <a href="https://rknight.me/next">next</a> or <a href="https://fyr.io/yep">yep</a><br />
<div class="outline-text-4" id="text-org1899f4e">
<p>
The better ideas should hopefully go here after I've given some thought and deemed them worth my time.
</p>
</div>
</li>
<li><a id="orgd446cd3"></a><span class="todo TODO">TODO</span> <a href="https://baty.net/nope">nope</a><br />
<div class="outline-text-4" id="text-orgd446cd3">
<p>
The not so good ideas will go here to remind myself not to keep thinking about them.
</p>
</div>
</li>
</ul>
</li>
<li><a id="org58f9320"></a><span class="todo TODO">TODO</span> Include a link a page on projects that I've developed<br /></li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-04-19 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
